#Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.


day = int(input("Введите число обозначающее день недели : "))
if day == 7 or day == 6:
    print("Этот день - выходной!")
elif day > 7 or day < 1:
    print ("Этот день выходит за рамки недели.")
else:
    print ("Этот день выходным не является.")

